In [ ]:
import pandas as pd

## Extraction

In [ ]:
travel_data = pd.read_csv ('https://drive.google.com/uc?id=1muwnik-uFGTKBdHmcQN5z68rD7qmdG-b')

In [ ]:
travel_data.shape

In [ ]:
travel_data.info()

In [ ]:
# Date has an object 
# Purpose has three Null value 
# Seperate date value into  day  month and  year 
# Seperate  name first and last name 
# Sepearte state and state

In [ ]:
travel_data.info()

In [ ]:
travel_data.drop_duplicates()

In [ ]:
travel_dataset = travel_data.copy() # creating of a copy of the dataset

## Cleaning

In [ ]:
travel_data['Travel Start Date'] = pd.to_datetime(travel_data['Travel Start Date'])

In [ ]:
def remove_white_space(text):
    if type(text)==str:
        return text.strip()
    return  text

In [ ]:
travel_dataset['Travel Start Date'] = travel_dataset['Travel Start Date'].apply( remove_white_space)
travel_dataset['Travel End Date'] = travel_dataset['Travel End Date'].apply( remove_white_space)

In [78]:
travel_dataset['Travel Start Date']= pd.to_datetime(travel_dataset['Travel Start Date'])

travel_dataset['Travel End Date']= pd.to_datetime(travel_dataset['Travel End Date'])

In [76]:
travel_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    datetime64[ns]
 3   Travel End Date        418 non-null    datetime64[ns]
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      415 non-null    object
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 19.7+ KB

In [81]:
travel_dataset[travel_dataset['Purpose Of Travel'].isna()]

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel
126,Gaila Compton,"OCEAN CITY, MD",2019-09-25,2019-09-27,690.00,NaN
274,Mark Sheelor,"LAS VEGAS, NV",2017-03-06,2017-03-08,1411.34,NaN
385,Tamara Maldonado,"OCEAN CITY, MD",2017-10-19,2017-10-20,73.50,NaN

In [83]:
travel_dataset['Purpose Of Travel']  = travel_dataset['Purpose Of Travel'].fillna('Not provided')

In [97]:
travel_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 6 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Employee               418 non-null    object
 1   Destination            418 non-null    object
 2   Travel Start Date      418 non-null    datetime64[ns]
 3   Travel End Date        418 non-null    datetime64[ns]
 4   Actual Total Expenses  418 non-null    float64
 5   Purpose Of Travel      418 non-null    object
dtypes: datetime64[ns](2), float64(1), object(3)
memory usage: 19.7+ KB

In [104]:
# sepearting first and last name. we are using  function and can be sepearted in with their dilmeter 
 
 
def Extract_state(text):
    result = text.split(',')[1]
    return result
    

def Extract_city(text):
    result = text.split(',')[0]
    return result

In [106]:
travel_dataset['state'] = travel_dataset['Destination'].apply(Extract_state)
travel_dataset['City'] = travel_dataset['Destination'].apply(Extract_city)

In [107]:
travel_dataset

,Employee,Destination,Travel Start Date,Travel End Date,Actual Total Expenses,Purpose Of Travel,state,City
0,Aaron Salter,"OCEAN CITY, MD",2017-05-31,2017-06-02,644.10,Conference,MD,OCEAN CITY
1,Abigail Ratnofsky,"SAN DIEGO, CA",2016-01-24,2016-01-29,2962.70,Conference,CA,SAN DIEGO
2,Adam Kisthardt,"ORLANDO, FL",2018-10-04,2018-10-09,1891.19,Conference,FL,ORLANDO
3,Adam P. Jones,"OCEAN CITY, MD",2016-06-19,2016-06-21,324.36,Conference,MD,OCEAN CITY
4,Alan Butsch,"SAN DIEGO, CA",2019-11-19,2019-11-22,2141.51,Conference,CA,SAN DIEGO
...,...,...,...,...,...,...,...,...
413,Warren Jensen!,"OCEAN CITY, MD",2017-11-06,2017-11-09,502.45,Conference,MD,OCEAN CITY
414,Warp Jensen,"OCEAN CITY, MD",2019-03-25,2019-03-26,78.00,Conference,MD,OCEAN CITY
415,Whitney Kujawa,"OCEAN CITY, MD",2017-11-06,2017-11-09,567.00,Conference,MD,OCEAN CITY
416,William Kinna,"CHARLOTTE, NC",2017-05-21,2017-05-26,2163.67,Conference,NC,CHARLOTTE
417,Xin Qi,"OCEAN CITY, MD",2019-08-13,2019-08-17,2107.51,Conference,MD,OCEAN CITY